Repository: rufatkiu/pipeline
Catalog: po/*.po
Languages: ar, hr, hu, ja, ru, sv

source: Follow video creators
hr: Praćenje autora videa
ja: 動画クリエイターをフォロー
ru: Смотреть видео
sv: Följ videoskapare

source: youtube;peertube;video;
ja: youtube;peertube;video;動画;
ru: youtube;peertube;видео;

source: Pipeline lets you watch and download videos from YouTube and PeerTube, all without needing to navigate through different websites.
hr: Pipeline omogućuje gledanje i preuzimanje videa s YouTubea i PeerTubea bez potrebe za navigacijom kroz različite web stranice.
hu: A pipeline-nal nézhetsz és letölthetsz videókat a Youtube-ról és a PeerTube-ról különféle weboldalak használata nélkül.
ja: Pipeline を使えば、違うウェブサイトを行き来することなく、YouTube と PeerTube の動画を視聴・ダウンロードすることができます。
ru: Pipeline позволяет вам смотреть и загружать видео с YouTube и PeerTube, без необходимости перемещаться по разным веб-сайтам.
sv: Pipeline låter dig titta på och ladda ner videor från YouTube och PeerTube, allt utan att behöva navigera genom olika webbplatser.

source: Pipeline comes with several features:
hr: Pipeline sadrži nekoliko značajki:
hu: A Pipeline sok funkcióval van felszerelve:
ja: Pipeline はいくつかの機能を搭載しています:
ru: Pipeline имеет следующие функции:
sv: Pipeline kommer med flera funktioner:

source: Subscribe to channels
hr: Pretplaćivanje na kanale
hu: Feliratkozás csatornákra
ja: チャンネルを登録
ru: Подписаться на каналы
sv: Prenumerera på kanaler

source: Play videos with any video player
hr: Reprodukcija videa s bilo kojim playerom
hu: Videók lejátszása bármilyen lejátszóprogrammal
ja: 任意のプレイヤーで動画を再生
ru: Открыть видео в любом видеоплеере
sv: Spela upp videor med vilken videospelare som helst

source: Filter out unwanted videos in the feed
hr: Filtriranje neželjenih videa u feedu
hu: Nem kívánt videók kiszűrése a kezdőlapról
ja: 除きたい動画をフィードから除外
ru: Скрывать нежелательные видео из рассылки
sv: Filtrera bort oönskade videor i flödet

source: Import subscriptions from NewPipe or YouTube
hr: Uvoz pretplata s NewPipe ili YouTube stranica
hu: Feliratkozása importálása NewPipe-ból vagy Youtube-ról
ja: NewPipeや YouTube から登録チャンネルをインポート
ru: Импортируйте подписки из NewPipe или Youtube
sv: Importera prenumerationer från NewPipe eller Youtube

source: Multiple platforms
hr: Podržava više platformi
hu: Több platformon elérhető
ja: 複数のプラットフォームに対応
ru: Несколько платформ
sv: Flera plattformar

source: Feed List
hr: Popis feedova
ja: フィードリスト
ru: Лента
sv: Flödeslista

source: Watch Later
ar: المشاهدة لاحقا
hr: Gledaj kasnije
hu: Nézd később
ja: 後で見る
ru: Смотреть позже
sv: Titta senare

source: Filter List
hr: Popis filtara
hu: Lista szűrése
ja: 絞り込みリスト
ru: Фильтры
sv: Filterlista

source: Subscriptions
ar: الاشتراكات
hr: Pretplate
hu: Feliratkozások
ja: 登録チャンネル
ru: Подписки
sv: Prenumerationer

source: Window width
hr: Širina prozora
hu: Ablak szélessége
ja: ウィンドウの幅
ru: Ширина окна
sv: Fönster bredd

source: Window height
hr: Visina prozora
hu: Ablak magassága
ja: ウィンドウの高さ
ru: Высота окна
sv: Fönster höjd

source: Window maximized state
hr: Maksimalno povećani prozor
hu: Ablak maximalizálás
ja: ウィンドウの最大化
ru: Состояние развёрнутого окна
sv: Fönster maximerat tillstånd

source: The player to use
hr: Korišteni player
ja: 使用するプレイヤー
ru: Используемый проигрыватель
sv: Spelaren att använda

source: The downloader to use
hr: Korišteni program za preuzimanje
ja: 使用するダウンローダー
ru: Используемый загрузчик
sv: Nedladdaren att använda

source: The piped api url
hr: URL piped API sučelja
ja: Piped API の URL
ru: Переданная ссылка на API
sv: piped api url

source: Only show videos of yesterday.
hr: Prikaži samo videa od jučer.
hu: Csak tegnapi videók mutatása.
ja: 昨日の動画のみ表示します。
ru: Показывать только вчерашние видео.
sv: Visa endast videos från igår.

source: Remove short videos.
hr: Ukloni kratka videa.
hu: Rövid videók eltávolítása.
ja: ショート動画を非表示にします。
ru: Скрыть короткие видео.
sv: Ta bort korta videos.

source: The type of platform for which the last subscription was added.
hr: Vrsta platforme za koju je dodana posljednja pretplata.
hu: A platform, amin a legutóbbi feliratkozás hozzá lett adva.
ja: 最後にチャンネル登録をしたときのチャンネルのプラットフォーム。
ru: Тип платформы, для которой была добавлена последняя подписка.
sv: Den typ av plattform som den senaste prenumerationen lades till.

source: Download
ar: نزّل المقطع المرئي
hr: Preuzmi
hu: Letöltés
ja: ダウンロード
ru: Скачать
sv: Ladda ner

source: Open in Browser
hr: Otvori u pregledniku
hu: Megnyitás böngészőben
ja: ブラウザで開く
ru: Открыть в браузере
sv: Öppna i webbläsare

source: Copy to Clipboard
ar: انسخ إلى الحافظة
hr: Kopiraj u međuspremnik
hu: Másolás a Vágólapra
ja: クリップボードにコピー
ru: Скопировать в буфер обмена
sv: Kopiera till urklipp

source: More Information
ar: المزيد
hr: Više informacija
hu: Több információ
ja: 追加情報
ru: Дополнительная информация
sv: Mer information

source: Failed to Download Video
hr: Neuspjelo preuzimanje videa
hu: A videó letöltése sikertelen
ja: 動画のダウンロードに失敗しました
ru: Не удалось загрузить видео
sv: Misslyckades att ladda ner video

source: Please check your downloader in the preferences.
hr: Provjeri program za preuzimanje u postavkama.
hu: Kérlek ellenőrizd a letöltődet a preferenciáknál.
ja: 設定でダウンローダーを確認してください。
ru: Пожалуйста, проверьте загрузчик в настройках.
sv: Kontrollera din nedladdningshanterare i inställningarna.

source: Close
ar: اغلاق
hr: Zatvori
hu: Bezárás
ja: 終了
ru: Закрыть
sv: Stäng

source: Failed to Play Video
hr: Neuspjela reprodukcija videa
hu: A videó lejátszása sikertelen
ja: 動画の再生に失敗しました
ru: Не удалось воспроизвести видео
sv: Misslyckades att spela upp video

source: Please check your player in the preferences.
hr: Provjeri player u postavkama.
hu: Kérlek ellenőrizd a lejátszód a preferenciákban.
ja: 設定でプレイヤーを確認してください。
ru: Пожалуйста, проверьте в настройках выбранный плеер.
sv: Kontrollera din spelare i inställningarna.

source: Feed
ar: الموجز
ja: フィード
ru: Лента
sv: Flöde

# accessibility
source: Reload
ar: إعادة تحميل
hr: Učitaj ponovo
hu: Újratöltés
ja: 再読み込み
ru: Перезагрузка
sv: Ladda om

# tooltip
source: Reload
ar: إعادة تحميل
hr: Učitaj ponovo
hu: Újratöltés
ja: 再読み込み
ru: Перезагрузка
sv: Ladda om

source: No Videos Found
ar: لا توجد مرئيات
hr: Nije pronađen nijedan video
hu: Nem találtunk videókat
ja: 動画が見つかりませんでした
ru: Ни одного видео не найдено
sv: Inga videor hittades

source: Your feed will appear once you've added subscriptions
ar: ستظهر قائمة الموجز الخاصة بك بمجرد إضافتك للإشتراكات
hr: Tvoj feed će se pojaviti nakon što dodaš pretplate
ja: チャンネル登録後にフィードを表示可能です
ru: Ваша лента появится, когда Вы подпишитесь хотя бы на один канал
sv: Ditt flöde kommer att visas när du har lagt till prenumerationer

source: Manage Subscriptions…
ar: تعديل الإشتراكات…
hr: Upravljaj pretplatama …
hu: Feliratkozások kezelése…
ja: 登録チャンネルの管理…
ru: Изменить подписки…
sv: Hantera prenumerationer…

source: Remove
ar: حذف
hr: Ukloni
hu: Eltávolít
ja: 除去
ru: Удалить
sv: Ta bort

source: Filters
ar: مُرشِّحات
hr: Filtri
hu: Szűrők
ja: 絞り込み
ru: Фильтры
sv: Filter

# accessibility
source: Add Filter…
ar: أضِف مُرشِّح…
hr: Dodaj filtar …
hu: Szűrő hozzáadása…
ja: 絞り込みを追加…
ru: Добавить фильтр.…
sv: Lägg till filter…

# tooltip
source: Add Filter…
ar: أضِف مُرشِّح…
hr: Dodaj filtar …
hu: Szűrő hozzáadása…
ja: 絞り込みを追加…
ru: Добавить фильтр…
sv: Lägg till filter…

source: No Filters
ar: لا توجد مُرشِّحات
hr: Bez filtara
hu: Nincsenek szűrők
ja: フィルターなし
ru: Нет фильтров
sv: Inga filter

source: Add Filter…
ar: أضِف مُرشِّح…
hr: Dodaj filtar …
hu: Szűrő hozzáadása…
ja: 絞り込みを追加…
ru: Добавить фильтр…
sv: Lägg till filter…

source: Add Filter
ar: أضِف مُرشِّح
hr: Dodaj filtar
hu: Filter hozzáadása
ja: 絞り込みを追加
ru: Добавить фильтр
sv: Lägg till filter

source: Title
ar: عنوان
hr: Naslov
hu: Cím
ja: 題名
ru: Название
sv: Titel

source: Channel Name
ar: اسم القناة
hr: Ime kanala
hu: Csatorna neve
ja: チャンネル名
ru: Название канала
sv: Kanalnamn

source: Cancel
ar: ألغِ
hr: Odustani
hu: Mégse
ja: キャンセル
ru: Отмена
sv: Avbryt

source: Add
ar: اضِف
hr: Dodaj
hu: Hozzáadás
ja: 追加
ru: Добавить
sv: Lägg till

source: Import Subscriptions
ar: استيرادات الاشتراكات
hr: Uvezi pretplate
hu: Feliratkozások importálása
ja: 登録チャンネルをインポート
ru: Подписки
sv: Importera prenumerationer

source: This will import your subscriptions from exported data from NewPipe or YouTube.
ar: سيؤدي هذا إلى استيراد اشتراكاتك من البيانات المصدرة من NewPipe أو YouTube.
hr: Ovo će uvesti tvoje pretplate iz izvezenih podataka s NewPipe ili YouTube stranica.
hu: Ez importája a feliratkozásaid NewPipe-ból vagy YouTube-ról exportált adatokból.
ja: これはNewPipeや YouTube からエクスポートしたデータから登録チャンネルをインポートします。
ru: Импортируйте ваши подписки из экспортированных данных NewPipe или Youtube.
sv: Detta kommer att importera dina prenumerationer från exporterad data från NewPipe eller YouTube.

source: General
ar: عام
hr: Općenito
hu: Általános
ja: 一般
ru: Основное
sv: Allmänt

source: Programs
ar: البرمجيات
hr: Programi
hu: Programok
ja: プログラム
ru: Программы
sv: Program

source: Player
ar: برنامج تشغيل المرئيات
hu: Lejátszó
ja: プレイヤー
ru: Плеер
sv: Spelare

source: Downloader
ar: برنامج تنزيل المرئيات
hr: Program za preuzimanje
hu: Letöltő
ja: ダウンローダー
ru: Загрузчик
sv: Nedladdare

source: APIs
ar: واجهات برمجة التطبيقات
hr: API sučelja
hu: APIk
ja: API
sv: API:er

source: For a complete list of public APIs, see the <a href="https://github.com/TeamPiped/Piped/wiki/Instances">Instances page</a>.
hr: Potpuni popis javnih API sučelja potraži na <a href="https://github.com/TeamPiped/Piped/wiki/Instances">stranici Instance</a>.
hu: Az API-k teljes listájáért lásd a <a href="https://github.com/TeamPiped/Piped/wiki/Instances">Példányok okdal</a>.
ja: 公開 API の完全な一覧は、<a href="https://github.com/TeamPiped/Piped/wiki/Instances">インスタンスのページ</a>をご覧ください。
ru: Для получения списка общедоступных API, смотрите <a href="https://github.com/TeamPiped/Piped/wiki/Instances">Instances
sv: För en komplett lista över offentliga API:er, se <a href="https://github.com/TeamPiped/Piped/wiki/Instances">Instanssidan</a>.

source: Piped API
ar: واجهة برمجة التطبيقات المتصلة
hr: Piped API sučelja
ja: Piped の API

source: Custom Piped API
ar: واجهة برمجة التطبيقات المتصلة والمخصصة
hr: Prilagođena Piped API sučelja
hu: Egyedi Piped API
ja: 独自の Piped API
ru: Особый канальный API
sv: Anpassat Piped API

source: Other
ar: أخرى
hr: Ostalo
hu: Egyéb
ja: ほか
ru: Другой
sv: Annat

source: Show only Videos from Yesterday
ar: أظهر مقاطع الفيديو من الأمس فقط
hr: Prikaži samo videa od jučer
hu: Csak tegnapi videók mutatása
ja: 昨日の動画のみ表示
ru: Показывать только вчерашние видео
sv: Visa endast videos från igår

source: Remove Short Videos
ar: إستبعاد مقاطع الفيديو القصيرة
hr: Ukloni kratka videa
hu: Rövid videók eltávolítása
ja: ショート動画を非表示
ru: Скрыть короткие видео
sv: Ta bort korta videos

source: Removes all videos shorter than 1 minute
ar: إستبعاد مقاطع الفيديو تحت الدقيقة
hr: Uklanja sva videa koji su kraći od jedne minute
hu: Eltávolítja az összes 1 percnél rövidebb videót
ja: 1分以下の動画を非表示
ru: Скрыть все видео короче минуты
sv: Tar bort alla videor som är kortare än 1 minut

source: No Subscriptions
ar: لا توجد اشتراكات
hr: Bez pretplata
hu: Nincsenek feliratkozások
ja: 登録チャンネルなし
ru: Нет подписок
sv: Inga prenumerationer

source: Subscribe to a Channel…
ar: اشترك في قناة…
hr: Pretplati se na jedan kanal …
hu: Iratkozz fel egy csatornára…
ja: チャネル登録する…
ru: Подписаться на канал…
sv: Prenumerera på en kanal…

source: Add Subscription
ar: أضِف اشتراك
hr: Dodaj pretplatu
hu: Feliratkozás hozzáadása
ja: 登録チャンネルを追加
ru: Добавить подписку
sv: Lägg till prenumeration

source: Base URL
ar: الرابط الرئيسي
hr: Osnovni URL
hu: Alap URL
ja: ベースURL
ru: Базовый URL
sv: Bas-URL

source: Channel ID or Name
ar: معرًف القناة أو الاسم
hr: ID ili ime kanala
hu: Csatorna azonosító vagy név
ja: チャネル ID か名前
ru: ID Канала или имя
sv: Kanal-ID eller namn

# accessibility
source: Add Subscription…
ar: أضِف اشتراك…
hr: Dodaj pretplatu …
hu: Feliratkozás hozzáadása…
ja: 登録チャンネルを追加…
ru: Добавить подписку…
sv: Lägg till prenumeration…

# tooltip
source: Add Subscription…
ar: أضِف اشتراك…
hr: Dodaj pretplatu …
hu: Feliratkozás hozzáadása…
ja: 登録チャンネルを追加…
ru: Добавить подписку…
sv: Lägg till prenumeration…

# accessibility
source: Go back to subscription list
hr: Idi natrag na popis pretplata
hu: Visszalépés a feliratkozások listára
ja: 登録チャンネル一覧に戻る
ru: Вернуться к списку подписок
sv: Gå tillbaka till prenumerationslistan

# tooltip
source: Go back
ar: رجوع
hr: Idi natrag
hu: Vissza
ja: 戻る
ru: Назад
sv: Gå tillbaka

source: Failed to add subscription
hr: Neuspjelo dodavanje pretplate
hu: Feliratkozás hozzáadása sikertelen
ja: 登録チャンネルを追加に失敗しました
ru: Не удалось добавить подписку
sv: Misslyckades med att lägga till prenumeration

source: Please check your input, internet connection and API URL.
ar: تأكد من المدخل, الانترنت أو عنوان واجهة برمجة التطبيقات.
hr: Provjeri unos, internetsku vezu i URL API sučelja.
hu: Kérlek ellenőrizd a bemenetet, az internet kapcsolatot és az API URL-t.
ja: 入力、インターネット接続、API の URL をご確認ください。
ru: Пожалуйста, проверьте ввод, интернет соединение и URL-адрес API.
sv: Kontrollera din inmatning, internetanslutning och API URL.

source: Video Information
ar: معلومات الفيديو
hr: Podaci videa
hu: Videó információ
ja: 動画の情報
ru: Видео информация

source: Everything Watched
ar: شاهدت كل شيئ
hr: Sve gledano
hu: Minden megnézve
ja: すべて視聴済み
ru: Всё просмотрено
sv: Allt sett

source: How about going outside?
ar: ماذا عن الخروج؟
hr: Zašto ne izađeš malo van?
hu: Miért nem mész ki egy kicsit a szabadba?
ja: 出かけるのはどうですか？
ru: Как насчёт прогулки?
sv: Vad sägs om att gå ut?

# accessibility
source: Primary menu
ar: القائمة الرئيسية
hr: Primarni izbornik
hu: Főmenü
ja: メインメニュー
ru: Главное меню
sv: Primär meny

# tooltip
source: Primary menu
ar: القائمة الرئيسية
hr: Primarni izbornik
hu: Főmenü
ja: メインメニュー
ru: Главное меню
sv: Primär meny

source: Import…
ar: إستيراد…
hr: Uvezi …
hu: Importálás…
ja: インポート…
ru: Импортировать…
sv: Importera…

source: Preferences
ar: تفضيلات
hr: Postavke
hu: Preferenciák
ja: 設定
ru: Предпочтения
sv: Inställningar

source: Keyboard Shortcuts
ar: إختصارات لوحة المفاتيح
hr: Tipkovni prečaci
hu: Gyorsbillentyűk
ja: キーボードショートカット
ru: Назначения клавиатуры
sv: Tangentbordsgenvägar

source: About Pipeline
hr: O Pipeline
hu: A Pipeline-ról
ja: Pipeline について
sv: Om Pipeline

source: Error connecting to the network
ar: خطأ في الاتصال بالشبكة
hr: Greška pri povezivanju s mrežom
hu: Nem sikerült az internethez csatlakozni
ja: ネットワーク接続のエラー
ru: Ошибка подключения к сети
sv: Fel vid anslutning till nätverket

source: Some error occured
ar: حدث خطأ ما
hr: Dogodila se neka greška
hu: Hiba lépett fel
ja: エラーが発生しました
ru: Произошла какая-то ошибка
sv: Något fel uppstod

source: Select NewPipe subscriptions file
ar: حدد ملف اشتراكات NewPipe
hr: Odaberi datoteku NewPipe pretplata
hu: Válaszd ki a NewPipe feliratkozások fájlt
ja: NewPipeの登録チャンネル用ファイルを選択
ru: Выберите файл подписки на NewPipe
sv: Välj NewPipe prenumerationsfil

source: Failure to import subscriptions
ar: خطأ في استيراد الاشتراكات
hr: Neuspio uvoz pretplata
hu: Nem sikerült a felirtkozások importálása
ja: 登録チャンネルのインポートに失敗
ru: Не удалось импортировать подписки
sv: Misslyckades med att importera prenumerationer

source: Select YouTube subscription file
ar: حدد ملف اشتراك
hr: Odaberi datoteku YouTube pretplate
hu: Válaszd ki a YouTube feliratkozások fájlt
ja: YouTubeの登録チャンネル用ファイルを選択
ru: Выберите файл подписки на YouTube
sv: Välj YouTube-prenumerationsfil

source: Note that on Flatpak, there are some more steps required when using a player external to the Flatpak. For more information, please consult the wiki.
ar: لاحظ أنه في فلاتباك هناك بعض الخطوات الإضافية المطلوبة عند استخدام مشغل فيديو خارجي للفلاتباك ، لمزيد من المعلومات يرجى الرجوع إلى الويكي.
hr: Imaj na umu da su na Flatpaku potrebni dodatni koraci kada koristiš eksterni player. Za više informacija pogledaj wiki.
ja: Flatpak では、Flatpak の外部のプレーヤーを使用する場合、さらにいくつかの手順が必要になることに注意してください。 詳細については、wiki を参照してください。
ru: Имейте в виду, что в Flatpak нужно сделать некоторые дополнительные шаги для использования внешнего плеера с Flatpak. Для дополнительной информации, пожалуйста обратитесь к вики.
sv: Observera att på Flatpak krävs ytterligare några steg när du använder en spelare utanför Flatpak. För mer information, se wikin.

source: Donate
ar: تبرّع
hr: Doniraj
hu: Adományozás
ja: 寄付する
ru: Донат
sv: Donera

source: translator-credits
ar: Original translators: please add here Waleed: waleed.exe@gmail.com
hr: Milo Ivir <mail@milotype.de>
ru: Давид Лапшин <ddaudix@gmail.com>
sv: Luna Jernberg <lunajernberg@gnome.org>

source: NewPipe
ru: Новичка

source: Error parsing one subscription
ar: خطأ في تحليل اشتراكات {}
hu: Hiba egy feliratkozás elemzése közben
ru: Ошибка анализа {} подписки
sv: Ett fel uppstod när en prenumeration skulle analyseras

source: %F %T
hr: %d. %m. %Y., %T
